merge: integrate dev into main
